tap "homebrew/bundle"

brew "age"
brew "b3sum"
brew "bash-completion@2"
brew "cmake"
brew "crane"
brew "dua-cli"
brew "duckdb"
brew "fd"
brew "fdk-aac-encoder"
brew "fish"
brew "fzf"
brew "gallery-dl"
brew "git"
brew "go"
brew "htop"
brew "hyperfine"
brew "iperf3"
brew "jq"
brew "lazygit"
brew "llvm"
brew "magic-wormhole.rs"
brew "media-info"
brew "meson"
brew "neovim"
brew "nnn"
brew "numbat"
brew "opus-tools"
brew "oxipng"
brew "parallel"
brew "pkgconf"
brew "powerlevel10k"
brew "python@3.12"
brew "qpdf"
brew "qrencode"
brew "rclone"
brew "ripgrep"
brew "rsgain"
brew "ruff"
brew "rustup"
brew "scc"
brew "shellcheck"
brew "shfmt"
brew "sigstore"
brew "sox"
brew "sqlfluff"
brew "streamrip"
brew "stylua"
brew "taplo"
brew "tree"
brew "uv"
brew "watchexec"
brew "yj"
brew "yt-dlp"

if OS.linux?
    brew "gcc@11"
    brew "mold"
    brew "valgrind"
    brew "xsel"
else
    brew "podman"
end

# vim: ft=ruby
